nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments20.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments20.devId   = 211;
resourceAssignments20.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments20.subtypeid  =  2;
resourceAssignments20.resourcerangestart =  316;
resourceAssignments20.resourcecount = 124;






resourceAssignments21.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments21.devId   = 211;
resourceAssignments21.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments21.subtypeid  =  3;
resourceAssignments21.resourcerangestart =  16;
resourceAssignments21.resourcecount = 124;






resourceAssignments22.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments22.devId   = 211;
resourceAssignments22.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_EXT' ;
resourceAssignments22.subtypeid  =  4;
resourceAssignments22.resourcerangestart =  140;
resourceAssignments22.resourcecount = 160;






resourceAssignments23.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments23.devId   = 211;
resourceAssignments23.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments23.subtypeid  =  5;
resourceAssignments23.resourcerangestart =  304;
resourceAssignments23.resourcecount = 12;






resourceAssignments24.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments24.devId   = 211;
resourceAssignments24.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_UH' ;
resourceAssignments24.subtypeid  =  6;
resourceAssignments24.resourcerangestart =  300;
resourceAssignments24.resourcecount = 4;






resourceAssignments25.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments25.devId   = 211;
resourceAssignments25.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_H' ;
resourceAssignments25.subtypeid  =  7;
resourceAssignments25.resourcerangestart =  4;
resourceAssignments25.resourcecount = 12;






resourceAssignments26.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments26.devId   = 211;
resourceAssignments26.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_UH' ;
resourceAssignments26.subtypeid  =  8;
resourceAssignments26.resourcerangestart =  0;
resourceAssignments26.resourcecount = 4;






resourceAssignments27.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments27.devId   = 211;
resourceAssignments27.subtype   = 'RESASG_SUBTYPE_RA_VIRTID' ;
resourceAssignments27.subtypeid  =  10;
resourceAssignments27.resourcerangestart =  0;
resourceAssignments27.resourcecount = 4096;






resourceAssignments28.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments28.devId   = 211;
resourceAssignments28.subtype   = 'RESASG_SUBTYPE_RA_MONITORS' ;
resourceAssignments28.subtypeid  =  11;
resourceAssignments28.resourcerangestart =  0;
resourceAssignments28.resourcecount = 32;






resourceAssignments29.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments29.devId   = 212;
resourceAssignments29.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_FLOW_COMMON' ;
resourceAssignments29.subtypeid  =  0;
resourceAssignments29.resourcerangestart =  140;
resourceAssignments29.resourcecount = 160;






resourceAssignments30.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments30.devId   = 212;
resourceAssignments30.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments30.subtypeid  =  1;
resourceAssignments30.resourcerangestart =  0;
resourceAssignments30.resourcecount = 1;






resourceAssignments31.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments31.devId   = 212;
resourceAssignments31.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments31.subtypeid  =  2;
resourceAssignments31.resourcerangestart =  49152;
resourceAssignments31.resourcecount = 1024;






resourceAssignments32.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments32.devId   = 212;
resourceAssignments32.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments32.subtypeid  =  3;
resourceAssignments32.resourcerangestart =  0;
resourceAssignments32.resourcecount = 1;






resourceAssignments33.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments33.devId   = 212;
resourceAssignments33.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments33.subtypeid  =  10;
resourceAssignments33.resourcerangestart =  16;
resourceAssignments33.resourcecount = 124;






resourceAssignments34.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments34.devId   = 212;
resourceAssignments34.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments34.subtypeid  =  11;
resourceAssignments34.resourcerangestart =  4;
resourceAssignments34.resourcecount = 12;






resourceAssignments35.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments35.devId   = 212;
resourceAssignments35.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_UHCHAN' ;
resourceAssignments35.subtypeid  =  12;
resourceAssignments35.resourcerangestart =  0;
resourceAssignments35.resourcecount = 4;






resourceAssignments36.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments36.devId   = 212;
resourceAssignments36.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments36.subtypeid  =  13;
resourceAssignments36.resourcerangestart =  16;
resourceAssignments36.resourcecount = 124;






resourceAssignments37.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments37.devId   = 212;
resourceAssignments37.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_ECHAN' ;
resourceAssignments37.subtypeid  =  14;
resourceAssignments37.resourcerangestart =  140;
resourceAssignments37.resourcecount = 160;






resourceAssignments38.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments38.devId   = 212;
resourceAssignments38.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments38.subtypeid  =  15;
resourceAssignments38.resourcerangestart =  4;
resourceAssignments38.resourcecount = 12;






resourceAssignments39.devname  = 'J721E_DEV_NAVSS0_UDMAP_0' ;
resourceAssignments39.devId   = 212;
resourceAssignments39.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_UHCHAN' ;
resourceAssignments39.subtypeid  =  16;
resourceAssignments39.resourcerangestart =  0;
resourceAssignments39.resourcecount = 4;






resourceAssignments40.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments40.devId   = 213;
resourceAssignments40.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments40.subtypeid  =  0;
resourceAssignments40.resourcerangestart =  10;
resourceAssignments40.resourcecount = 178;






