nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments41.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments41.devId   = 213;
resourceAssignments41.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments41.subtypeid  =  213;
resourceAssignments41.resourcerangestart =  196;
resourceAssignments41.resourcecount = 28;






resourceAssignments42.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments42.devId   = 213;
resourceAssignments42.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments42.subtypeid  =  213;
resourceAssignments42.resourcerangestart =  228;
resourceAssignments42.resourcecount = 28;






resourceAssignments43.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments43.devId   = 213;
resourceAssignments43.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments43.subtypeid  =  213;
resourceAssignments43.resourcerangestart =  260;
resourceAssignments43.resourcecount = 28;






resourceAssignments44.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments44.devId   = 213;
resourceAssignments44.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments44.subtypeid  =  213;
resourceAssignments44.resourcerangestart =  292;
resourceAssignments44.resourcecount = 52;






resourceAssignments45.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments45.devId   = 213;
resourceAssignments45.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments45.subtypeid  =  213;
resourceAssignments45.resourcerangestart =  348;
resourceAssignments45.resourcecount = 28;






resourceAssignments46.devname  = 'J721E_DEV_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments46.devId   = 213;
resourceAssignments46.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments46.subtypeid  =  213;
resourceAssignments46.resourcerangestart =  380;
resourceAssignments46.resourcecount = 132;






resourceAssignments47.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments47.devId   = 233;
resourceAssignments47.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments47.subtypeid  =  10;
resourceAssignments47.resourcerangestart =  8;
resourceAssignments47.resourcecount = 248;






resourceAssignments48.devname  = 'J721E_DEV_MCU_NAVSS0_INTAGGR_0' ;
resourceAssignments48.devId   = 233;
resourceAssignments48.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments48.subtypeid  =  13;
resourceAssignments48.resourcerangestart =  16392;
resourceAssignments48.resourcecount = 1528;






resourceAssignments49.devname  = 'J721E_DEV_MCU_NAVSS0_PROXY_0' ;
resourceAssignments49.devId   = 234;
resourceAssignments49.subtype   = 'RESASG_SUBTYPE_PROXY_PROXIES' ;
resourceAssignments49.subtypeid  =  0;
resourceAssignments49.resourcerangestart =  1;
resourceAssignments49.resourcecount = 63;






resourceAssignments50.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments50.devId   = 235;
resourceAssignments50.subtype   = 'RESASG_SUBTYPE_RA_ERROR_OES' ;
resourceAssignments50.subtypeid  =  0;
resourceAssignments50.resourcerangestart =  0;
resourceAssignments50.resourcecount = 1;






resourceAssignments51.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments51.devId   = 235;
resourceAssignments51.subtype   = 'RESASG_SUBTYPE_RA_GP' ;
resourceAssignments51.subtypeid  =  1;
resourceAssignments51.resourcerangestart =  96;
resourceAssignments51.resourcecount = 156;






resourceAssignments52.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments52.devId   = 235;
resourceAssignments52.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments52.subtypeid  =  2;
resourceAssignments52.resourcerangestart =  50;
resourceAssignments52.resourcecount = 43;






resourceAssignments53.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments53.devId   = 235;
resourceAssignments53.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments53.subtypeid  =  3;
resourceAssignments53.resourcerangestart =  2;
resourceAssignments53.resourcecount = 44;






resourceAssignments54.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments54.devId   = 235;
resourceAssignments54.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments54.subtypeid  =  5;
resourceAssignments54.resourcerangestart =  48;
resourceAssignments54.resourcecount = 2;






resourceAssignments55.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments55.devId   = 235;
resourceAssignments55.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_H' ;
resourceAssignments55.subtypeid  =  7;
resourceAssignments55.resourcerangestart =  0;
resourceAssignments55.resourcecount = 2;






resourceAssignments56.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments56.devId   = 235;
resourceAssignments56.subtype   = 'RESASG_SUBTYPE_RA_VIRTID' ;
resourceAssignments56.subtypeid  =  10;
resourceAssignments56.resourcerangestart =  0;
resourceAssignments56.resourcecount = 4096;






resourceAssignments57.devname  = 'J721E_DEV_MCU_NAVSS0_RINGACC_0' ;
resourceAssignments57.devId   = 235;
resourceAssignments57.subtype   = 'RESASG_SUBTYPE_RA_MONITORS' ;
resourceAssignments57.subtypeid  =  11;
resourceAssignments57.resourcerangestart =  0;
resourceAssignments57.resourcecount = 32;






resourceAssignments58.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments58.devId   = 236;
resourceAssignments58.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_FLOW_COMMON' ;
resourceAssignments58.subtypeid  =  0;
resourceAssignments58.resourcerangestart =  48;
resourceAssignments58.resourcecount = 48;






resourceAssignments59.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments59.devId   = 236;
resourceAssignments59.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments59.subtypeid  =  1;
resourceAssignments59.resourcerangestart =  0;
resourceAssignments59.resourcecount = 1;






resourceAssignments60.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments60.devId   = 236;
resourceAssignments60.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments60.subtypeid  =  2;
resourceAssignments60.resourcerangestart =  56320;
resourceAssignments60.resourcecount = 256;






resourceAssignments61.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments61.devId   = 236;
resourceAssignments61.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments61.subtypeid  =  3;
resourceAssignments61.resourcerangestart =  0;
resourceAssignments61.resourcecount = 1;






resourceAssignments62.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments62.devId   = 236;
resourceAssignments62.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments62.subtypeid  =  10;
resourceAssignments62.resourcerangestart =  2;
resourceAssignments62.resourcecount = 43;






resourceAssignments63.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments63.devId   = 236;
resourceAssignments63.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments63.subtypeid  =  11;
resourceAssignments63.resourcerangestart =  0;
resourceAssignments63.resourcecount = 2;






resourceAssignments64.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments64.devId   = 236;
resourceAssignments64.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments64.subtypeid  =  13;
resourceAssignments64.resourcerangestart =  2;
resourceAssignments64.resourcecount = 44;






resourceAssignments65.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments65.devId   = 236;
resourceAssignments65.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments65.subtypeid  =  15;
resourceAssignments65.resourcerangestart =  0;
resourceAssignments65.resourcecount = 2;






resourceAssignments66.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments66.devId   = 237;
resourceAssignments66.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments66.subtypeid  =  0;
resourceAssignments66.resourcerangestart =  4;
resourceAssignments66.resourcecount = 28;






resourceAssignments67.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments67.devId   = 237;
resourceAssignments67.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments67.subtypeid  =  237;
resourceAssignments67.resourcerangestart =  36;
resourceAssignments67.resourcecount = 28;






